-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 25 2022 г., 18:56
-- Версия сервера: 5.7.36
-- Версия PHP: 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `internat`
--

-- --------------------------------------------------------

--
-- Структура таблицы `plan`
--

DROP TABLE IF EXISTS `plan`;
CREATE TABLE IF NOT EXISTS `plan` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `task` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `day` varchar(20) COLLATE utf8_bin NOT NULL,
  `morning` tinyint(1) NOT NULL,
  `evenig` int(11) NOT NULL,
  `description` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `updated` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=36 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `plan`
--

INSERT INTO `plan` (`id`, `task`, `day`, `morning`, `evenig`, `description`, `updated`, `created`) VALUES
(1, 'Бег 3 км', 'Понедельник', 1, 0, 'Разминка, бег у моря', '2022-07-12 19:53:40', '2022-07-12 19:53:40'),
(2, 'пары', 'суббота', 1, 0, 'бег,общая разминка,пары-10 раундов,ОФП', '2011-07-24 00:00:00', '2022-07-24 00:00:00'),
(3, 'пары', 'понедельник', 1, 1, 'пары, фронткик -отработки', '2022-08-18 00:00:00', '2022-08-18 00:00:00'),
(4, 'отработка защиты -блоки ногами', 'понедельник', 1, 1, 'основные отработки - удар блок,блок удар.', '2022-09-14 00:00:00', '2022-09-14 00:00:00'),
(5, 'руки-основные связки', 'вторник', 1, 0, 'кросс,работа в парах', '2022-09-15 00:00:00', '2022-09-15 00:00:00'),
(6, 'интервальная работа на мешках', 'среда', 1, 1, 'кросс,работа на мешках.', '2022-09-15 20:24:00', '2022-09-15 20:24:00'),
(7, 'удары ногами', 'четверг', 1, 0, 'кросс,робота в парах', '2022-09-15 20:28:00', '2022-09-15 20:29:00'),
(8, 'спаринги', 'пятница', 1, 1, '12-раундов произвольно', '2022-09-15 20:32:00', '2022-09-15 20:32:00'),
(9, 'игровая тренеровка', 'суббота', 1, 0, 'футбол', '2022-09-15 20:32:00', '2022-09-15 20:32:00'),
(10, 'ноги- основные связки', 'понедельник', 1, 1, 'разминка,работа по-школе, работа в парах ', '2002-08-28 00:00:00', '2022-08-28 00:00:00'),
(11, 'колени', 'вторник', 1, 0, 'бег, разминка,отработки -вход в клинч', '2022-08-29 00:00:00', '2022-08-29 00:00:00'),
(12, 'руки, челнок', 'среда', 1, 1, 'разминка,отработки', '2022-08-30 00:00:00', '2022-08-30 00:00:00'),
(13, 'колени с дистанции', 'четверг', 1, 0, '[value-6]', '2022-08-31 00:00:00', '2022-08-31 00:00:00'),
(14, 'клинч', 'пятница', 1, 1, 'отработки -вход в клинч', '2022-09-02 00:00:00', '2022-09-02 00:00:00'),
(15, 'игровая тренеровка', 'суббота', 1, 0, 'футбол', '2022-09-02 20:39:00', '2022-09-02 20:39:00'),
(16, 'ноги-защита.блоки', 'понедельник', 1, 1, 'работа в парах', '2022-09-05 00:00:00', '2022-09-05 00:00:00'),
(17, 'ноги', 'вторник', 1, 1, 'отработки основных связок', '2022-09-06 20:46:00', '2022-09-06 20:46:00'),
(18, 'руки', 'среда', 1, 1, 'работа по школе, мешки', '2022-09-09 00:00:00', '2022-09-09 00:00:00'),
(19, 'ноги', 'четверг', 1, 1, 'мешки,лоу кик.', '2022-09-09 20:30:00', '2022-09-09 20:35:00'),
(20, 'клинч', 'пятница', 1, 1, 'вход в клинч', '2022-09-09 20:37:00', '2022-09-09 20:37:00'),
(21, 'кросс', 'суббота', 1, 0, 'кросс, работа в парах', '2022-09-09 20:39:00', '2022-09-09 20:40:00'),
(22, ' ноги ', 'понедельник', 1, 1, 'работа на мешках,в парах произвольно', '2022-09-10 00:00:00', '2022-09-10 00:00:00'),
(23, 'клинч', 'вторник', 1, 1, 'клинч , пары произвольно', '2022-09-13 00:00:00', '2022-09-13 00:00:00'),
(24, 'руки', 'среда', 1, 1, 'работа на мешках', '2022-09-13 18:03:00', '2022-09-13 18:03:00'),
(25, 'ноги-колени', 'четверг', 1, 1, 'отработки в парах,мешки', '2022-09-14 00:00:00', '2022-09-14 00:00:00'),
(26, 'клинч', 'пятница', 1, 0, 'работа в парах', '2022-09-21 00:00:00', '2022-09-21 00:00:00'),
(27, 'Ноги', 'понедельник', 1, 1, 'блок=ответ работа в парах', '2022-09-22 00:00:00', '2022-09-22 00:00:00'),
(28, 'ноги', 'вторник', 1, 1, 'интервальная работа на мешках', '2022-09-22 20:17:00', '2022-09-22 20:18:00'),
(29, 'руки', 'среда', 1, 1, 'работа на мешках и в парах ', '2022-09-22 20:22:20', '2022-09-22 20:24:00'),
(30, 'ноги', 'четверг', 1, 1, 'удары -блоки', '2022-09-23 00:00:00', '2022-09-23 00:00:00'),
(31, 'произвольная работа', 'пятница', 1, 1, 'в парах 3 раунда', '2022-09-23 20:27:00', '2022-09-23 20:27:00'),
(32, 'кросс', 'суббота', 1, 0, '20км', '2022-09-23 20:30:00', '2022-09-23 20:31:00'),
(33, 'ноги', 'понедельник', 1, 1, 'мешки,пары', '2022-09-25 00:00:00', '2022-09-25 00:00:00'),
(34, 'ноги -руки', 'вторник', 1, 1, 'мешки,пары', '2022-09-25 20:50:00', '2022-09-25 20:51:00'),
(35, 'руки', 'среда', 1, 1, 'интервальная работа на мешках', '2022-09-25 20:54:00', '2022-09-25 20:55:00');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
