-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 27 2022 г., 18:42
-- Версия сервера: 5.7.36
-- Версия PHP: 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `internat`
--

-- --------------------------------------------------------

--
-- Структура таблицы `international_events`
--

DROP TABLE IF EXISTS `international_events`;
CREATE TABLE IF NOT EXISTS `international_events` (
  `id` int(100) NOT NULL AUTO_INCREMENT,
  `year` int(10) NOT NULL,
  `name_event` varchar(50) COLLATE utf8_bin NOT NULL,
  `country` varchar(50) COLLATE utf8_bin NOT NULL,
  `sportsman` varchar(50) COLLATE utf8_bin NOT NULL,
  `weight_kg` int(20) NOT NULL,
  `result` varchar(20) COLLATE utf8_bin NOT NULL,
  `createdAt` datetime(6) NOT NULL,
  `updatedAt` datetime(6) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `createdAt` (`createdAt`),
  UNIQUE KEY `createdAt_2` (`createdAt`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=63 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `international_events`
--

INSERT INTO `international_events` (`id`, `year`, `name_event`, `country`, `sportsman`, `weight_kg`, `result`, `createdAt`, `updatedAt`) VALUES
(1, 2006, 'чемпионат мира', 'Тайланд', 'Андрей Яцун', 48, 'серебро', '2022-07-14 00:00:00.000000', '2022-07-14 00:00:00.000000'),
(4, 2007, 'чемпионат мира', 'Тайланд', 'Куляба Сергей', 60, 'серебро', '2022-07-15 20:47:00.000000', '2022-07-15 00:00:00.000000'),
(16, 2010, 'чемпионат мира', 'Тайланд', 'Куляба Сергей', 64, 'серебро', '2022-07-16 20:26:00.000000', '2022-07-16 00:00:00.000000'),
(18, 2011, 'чемпионат европы', 'Турция', 'Любченко Игорь', 60, 'серебро', '2022-07-17 17:01:00.000000', '2022-07-17 00:00:00.000000'),
(21, 2011, 'чемпионат мира', 'Узбекистан', 'Любченко Игорь', 60, 'серебро', '2022-07-17 17:13:00.000000', '2022-07-17 00:00:00.000000'),
(23, 2012, 'чемпионат европы', 'Турция', 'Любченко Игорь', 64, 'серебро', '2022-07-17 17:22:00.000000', '2022-07-17 00:00:00.000000'),
(24, 2012, 'чемпионат европы', 'Турция', 'Куляба Сергей', 67, 'серебро', '2022-07-17 17:26:00.000000', '2022-07-17 00:00:00.000000'),
(26, 2013, 'чемпионат европы', 'Португалия', 'Шармонова 	Анастасия', 60, 'серебро', '2022-07-17 20:09:00.000000', '2022-07-17 00:00:00.000000'),
(27, 2013, 'Combat Games', 'Россия', 'Шармонова Анастасия', 60, 'серебро', '2022-07-17 20:14:00.000000', '2022-07-17 00:00:00.000000'),
(29, 2013, 'чемпионат мира', 'Россия', 'Куляба Сергей', 67, 'серебро', '2022-07-17 20:21:00.000000', '2022-07-17 00:00:00.000000'),
(32, 2014, 'чемпионат европы', 'Польша', 'Любченко Игорь', 64, 'серебро', '2022-07-17 20:33:00.000000', '2022-07-17 00:00:00.000000'),
(51, 2017, 'чемпионат европы', 'Франция', 'Булат Валентин', 57, 'серебро', '2022-07-19 19:48:00.000000', '2022-07-19 00:00:00.000000'),
(54, 2018, 'чемпионат мира среди юниоров', 'Тайланд', 'Мустафаев Шамиль', 67, 'серебро', '2022-07-19 20:00:00.000000', '2022-07-19 00:00:00.000000'),
(55, 2019, 'чемпионат мира среди юниоров', 'Турция', 'Бачинский Филипп    ', 54, 'серебро', '2022-07-19 20:13:00.000000', '2022-07-19 00:00:00.000000'),
(58, 2021, 'чемпионат мира', 'Тайланд', 'Любченко Игорь', 64, 'серебро', '2022-07-19 20:26:00.000000', '2022-07-19 00:00:00.000000');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
