-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 27 2022 г., 18:40
-- Версия сервера: 5.7.36
-- Версия PHP: 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `internat`
--

-- --------------------------------------------------------

--
-- Структура таблицы `international_events`
--

DROP TABLE IF EXISTS `international_events`;
CREATE TABLE IF NOT EXISTS `international_events` (
  `id` int(100) NOT NULL AUTO_INCREMENT,
  `year` int(10) NOT NULL,
  `name_event` varchar(50) COLLATE utf8_bin NOT NULL,
  `country` varchar(50) COLLATE utf8_bin NOT NULL,
  `sportsman` varchar(50) COLLATE utf8_bin NOT NULL,
  `weight_kg` int(20) NOT NULL,
  `result` varchar(20) COLLATE utf8_bin NOT NULL,
  `createdAt` datetime(6) NOT NULL,
  `updatedAt` datetime(6) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `createdAt` (`createdAt`),
  UNIQUE KEY `createdAt_2` (`createdAt`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=63 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `international_events`
--

INSERT INTO `international_events` (`id`, `year`, `name_event`, `country`, `sportsman`, `weight_kg`, `result`, `createdAt`, `updatedAt`) VALUES
(2, 2007, 'чемпионат мира', 'Тайланд', 'Приходько Дмитрий', 45, 'золото', '2022-07-15 00:00:00.000000', '2022-07-15 00:00:00.000000'),
(5, 2008, 'кубок наций', 'Литва', 'Куляба Сергей', 60, 'золото', '2022-07-15 20:58:00.000000', '2022-07-15 00:00:00.000000'),
(6, 2008, 'чемпионат европы', 'Польша', 'Приходько Дмитрий', 48, 'золото', '2022-07-15 21:05:00.000000', '2022-07-15 00:00:00.000000'),
(7, 2008, 'чемпионат европы', 'Польша', 'Любченко Игорь', 54, 'золото', '2022-07-15 21:10:00.000000', '2022-07-15 00:00:00.000000'),
(8, 2008, 'TreX-GAMES', 'Корея', 'Приходько Дмитрий', 45, 'золото', '2022-07-15 21:16:00.000000', '2022-07-15 00:00:00.000000'),
(10, 2009, 'чемпионат европы', 'Латвия', 'Тишляков Алексей', 54, 'золото', '2022-07-15 21:30:00.000000', '2022-07-15 00:00:00.000000'),
(12, 2010, 'чемпионат европы', 'Италия', 'Любченко Игорь', 57, 'золото', '2022-07-16 00:00:00.000000', '2022-07-16 00:00:00.000000'),
(14, 2010, 'Combat Games', 'Китай', 'Любченко Игорь', 57, 'золото', '2022-07-16 20:13:00.000000', '2022-07-16 00:00:00.000000'),
(15, 2010, 'чемпионат мира', 'Тайланд', 'Кошкин Алексей', 45, 'золото', '2022-07-16 20:22:00.000000', '2022-07-16 00:00:00.000000'),
(17, 2011, 'чемпионат европы', 'Турция', 'Кошкин Алексей', 48, 'золото', '2022-07-17 00:00:00.000000', '2022-07-17 00:00:00.000000'),
(22, 2012, 'чемпионат мира', 'Россия', 'Любченко Игорь', 64, 'золото', '2022-07-17 17:17:00.000000', '2022-07-17 00:00:00.000000'),
(25, 2013, 'чемпионат европы', 'Португалия', 'Куляба Сергей', 67, 'золото', '2022-07-17 20:04:00.000000', '2022-07-17 00:00:00.000000'),
(28, 2013, 'Combat Games', 'Россия', 'Любченко Игорь', 64, 'золото', '2022-07-17 20:17:00.000000', '2022-07-17 00:00:00.000000'),
(30, 2014, 'чемпионат мира', 'Малазия', 'Любченко Игорь\r\n                                  ', 64, 'золото', '2022-07-17 20:26:00.000000', '2022-07-17 00:00:00.000000'),
(31, 2014, 'чемпионат европы', 'Польша', 'Шармонова Анастасия', 57, 'золото', '2022-07-17 20:30:00.000000', '2022-07-17 00:00:00.000000'),
(34, 2015, 'чемпионат мира среди студентов', 'Тайланд', 'Куляба Сергей', 67, 'золото', '2022-07-18 00:00:00.000000', '2022-07-18 00:00:00.000000'),
(36, 2015, 'чемпионат мира', 'Тайланд', 'Любченко Игорь', 64, 'золото', '2022-07-18 20:50:00.000000', '2022-07-18 00:00:00.000000'),
(37, 2016, 'чемпионат мира', 'Швеция', 'Любченко Игорь', 64, 'золото', '2022-07-18 20:54:00.000000', '2022-07-18 00:00:00.000000'),
(38, 2016, 'чемпионат мира среди детей', 'Тайланд', 'Бачинский Филипп', 42, 'золото', '2022-07-18 21:00:00.000000', '2022-07-18 00:00:00.000000'),
(40, 2016, 'кубок мира', 'Россия', 'Любченко Игорь', 64, 'золото', '2022-07-17 21:08:00.000000', '2022-07-16 00:00:00.000000'),
(41, 2016, 'кубок мира', 'Россия', 'Куляба Сергей', 67, 'золото', '2022-07-18 21:13:00.000000', '2022-07-18 00:00:00.000000'),
(42, 2017, 'чемпионат мира среди юниоров', 'Тайланд', 'Мустафаев Шамиль', 67, 'золото', '2022-07-18 21:20:00.000000', '2022-07-18 00:00:00.000000'),
(43, 2017, 'чемпионат мира среди детей', 'Тайланд', 'Бачинский Филипп', 45, 'золото', '2022-07-18 21:25:00.000000', '2022-07-18 00:00:00.000000'),
(44, 2017, 'всемирные игры', 'Польша', 'Любченко Игорь', 64, 'золото', '2022-07-18 21:30:00.000000', '2022-07-18 00:00:00.000000'),
(45, 2017, 'всемирные игры', 'Польша', 'Куляба Сергей', 67, 'золото', '2022-07-18 21:36:00.000000', '2022-07-18 00:00:00.000000'),
(46, 2017, 'кубок Анталии', 'Турция', 'Бачинский Филипп', 48, 'золото', '2022-07-19 00:00:00.000000', '2022-07-19 00:00:00.000000'),
(47, 2017, 'кубок Анталии', 'Турция', 'Мустафаев Шамиль', 67, 'золото', '2022-07-19 19:31:00.000000', '2022-07-19 00:00:00.000000'),
(49, 2017, 'кубок Анталии', 'Турция', 'Березовский Александр', 75, 'золото', '2022-07-19 19:39:00.000000', '2022-07-19 00:00:00.000000'),
(52, 2018, 'чемпионат мира', 'Мексика', 'Любченко Игорь', 64, 'золото', '2022-07-19 19:51:00.000000', '2022-07-19 00:00:00.000000'),
(53, 2018, 'чемпионат мира среди юниоров', 'Тайланд', 'Бачинский Филипп', 48, 'золото', '2022-07-19 19:58:00.000000', '2022-07-19 00:00:00.000000'),
(56, 2019, 'чемпионат мира', 'Тайланд', 'Любченко Игорь', 64, 'золото', '2022-07-19 20:17:00.000000', '2022-07-19 00:00:00.000000'),
(57, 2019, 'AFURA Games', 'Австралия', 'Любченко Игорь', 64, 'золото', '2022-07-19 20:21:00.000000', '2022-07-19 00:00:00.000000'),
(61, 2022, 'всемирные игры', 'США', 'Любченко Игорь', 64, 'золото', '2022-07-19 20:37:00.000000', '2022-07-19 00:00:00.000000');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
